
<div class="container">

<h1 class="mdc-typography--headline3">Svelte-eCart について</h1>

<h3 class="mdc-typography--headline4">概要と特徴</h3>
<ul>
   <li>当ソフトウェアは、IT 技術に不慣れな人でも導入と運営が容易に出来る様に作られています。</li>
   <li>データの変更追加は、お使いのエディタ(メモ帳など)で簡単に編集することが出来ます。</li>
   <li>サーバー側の技術(CGI 等)を用いていませんので、設置に特別な知識は必要としません。</li>
   <li>OS(Windows, iOS, Linux 等)や携帯端末機種に依存しませんので、どのブラウザ(IE11 以降)でも閲覧可能です。</li>
   <li>ローカル環境でも動作し、サーバーへのアップロード前にテスト及び修正を十分行うことが出来ます(インターネット接続は必要)。</li>
   <li>購買者からの注文メイルの送信も PC・携帯端末に備わったメイル機能を利用しサーバーに依存しません。</li>
</ul>

<h3 class="mdc-typography--headline4">制作の目的</h3>
<ul>
   <li>新型コロナウイルス感染症 (COVID-19) の猖獗に依り国全体が経済的困窮に陥いる中、生産者及び消費者が互いに結び付くことで共同して状況に対処していくことを目的としています。</li>
   <li>大手IT企業の提供するプラットフォームを通すことは、初期費用やシステム利用料及び売上ロイヤルティ等は無料と謳っていますが、売上に即して様々な名目の負担金を徴収されます(約30%程度)。そうした中間的に掛かる余分な費用を一切無くし、購買者との直接の決済手数料のみに限定することで、生産者の所得と生活の向上を保証していくことを重要と考えます。</li>
   <li>HP運営上必要な経費は、ホスティング料(最安値)と大手IT企業の提供するプラットフォームを通すことは、初期費用やシステム利用料及び売上ロイヤルティ等は無料と謳っていますが、売上に即して様々な名目の負担金を徴収されます(約30%程度)。そうした中間的に掛かる余分な費用を一切無くし、購買者との直接の決済手数料のみに限定することで、生産者の所得と生活の向上を保証していくことを重要と考えます。</li>

   <li>特に農業分野での活用を想定し、通常の商品は勿論、今迄B級品として外されていた類のものも含め流通に乗せることで生産者の増収を計り、一方安価で消費者に提供可能とすることを期待しています。</li>
   <li>地域性を平準化するIT技術の特性を生かしそれを駆使することで、地方と都市との格差を少しでも無くしていくことを理念として制作されています。</li>
</ul>

<h3 class="mdc-typography--headline4">使用上の注意</h3>
<ul>
   <li>当ソフトウェアは、オープンソースとして公開されています(MIT ライセンス)。</li>
   <li>当システムでは、Google社の提供するWebフォントやデザインシステム(MDC)を用いています。速度向上の為ブラウザが閲覧の最初にリソースをその都度ダウンロードする仕様となっています（CDN）。その為、ローカル作業時においてもインターネット接続は必要です。</li>
   <li>回線負荷軽減の為に、リソースをローカルに設置しフォントのみをダウンロードして編集作業の出来るローカル用環境も用意しています(index-local.html)。</li>
   <li>サーバー設置時には全て</li>
   
</ul>
  
<h3 class="mdc-typography--headline4">免責事項</h3>
<ul>
   <li>当ソフトウェアを使うことで生じた運営上の損害に対し、如何なる場合にもその責任を負うことは出来ません。</li>
   <li>使用者自らの責任においてのみ活用をお願いします。</li>
</ul>

</div>     
     
<style>

.list{
   font-size:2em;
}

.tbl-data td{
   height:24px;
}

</style>     
